---
kind: method
id: M:Autodesk.Revit.DB.LinearArray.GetCopiedMemberIds
source: html/1d424df0-983c-4ebd-b749-6bec157e30b5.htm
---
# Autodesk.Revit.DB.LinearArray.GetCopiedMemberIds Method

Retrieves the copied member Ids of the Array.

## Syntax (C#)
```csharp
public override ICollection<ElementId> GetCopiedMemberIds()
```

## Returns
The copied member Ids of the Array